<?php
// 8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».

$areas = [
    "Амурская Область" => ["Завитинск", "Зея", "Райчихинск", "Свободный", "Тында", "Шимановск"],
    "Архангельская Область" => ["Архангельск", "Вельск", "Каргополь"],
    "Белгородская Область" => ["Алексеевка", "Белгород", "Бирюч", "Валуйки"],
    "Брянская Область" => ["Брянск", "Дятьково", "Жуковка", "Злынка", "Карачев", "Клинцы", "Мглин", "Новозыбков"],
    "Иркутская Область" => ["Алзамай"]
];

foreach ($areas as $key => $values) {
    echo $key. ":"."<br>";
    foreach ($values as $city) {
        if (mb_substr($city, 0, 1) == "К") {
            echo $city . "<br>";
        }
    }
};
